// /config.js
(function (w) {
    // w.WEB_BASE = location.origin;          // 协议 + 域名 + 端口
    w.WEB_BASE = "http://10.250.101.238:5000" ||"http://localhost:5000"
    w.API_BASE = w.WEB_BASE + '/api';      // API 前缀
})(window);

const allow_chars_status = new Set([
    "攝","摄","呼","等","韻","韵","入","調","调","清","濁","浊","系","組","组","母",
    "假","咸","宕","山","效","曾","果","梗","止","江","流","深","臻","蟹","通","遇",
    "合","開","开","一","三","二","四","之","仙","佳","侯","侵","元","先","冬","凡","刪","删",
    "咍","唐","嚴","严","夬","宵","寒","尤","幽","庚","廢","废","微","支","文","東","东","桓","模",
    "欣","歌","泰","添","灰","痕","登","皆","真","祭","耕","肴","脂","蒸","蕭","萧","虞","覃",
    "談","谈","豪","銜","衔","鍾","钟","陽","阳","青","魂","魚","鱼","鹽","盐","麻","齊","齐",
    "舒","上","去","平","全","次","幫","帮","知","端","見","见","影","日","曉","晓","泥","章",
    "精","莊","庄","非","並","并","云","雲","以","來","来","初","匣","奉","娘","定","崇","常",
    "從","从","徹","彻","心","敷","昌","明","書","书","溪","滂","澄","生","疑","禪","禅","群","船","透","邪",
    "部", "位", "方", "式", "俟", "齶", "脣", "锐", "銳", "齿", "卷", "软", "双", "A", "B", "C",
    "唇", "齒", "喉", "捲", "舌", "腭", "軟", "雙", "塞", "擦", "近", "鼻",
    "@", "-", "#", "*"," ", "\n", ";"," ,", "\t"
]);

const allow_chars_groups = new Set([
    "攝","摄","呼","等","韻","韵","入","調","调","清","濁","浊","系","組","组","母","部", "位", "方", "式", " ", "\n", ";"," ,", "\t"
]);
const column_values = {
    '攝': ['假', '咸', '宕', '山', '效', '曾', '果', '梗', '止', '江', '流', '深', '臻', '蟹', '通', '遇'],
    '韻': ['之', '仙', '佳', '侯', '侵', '元', '先', '冬', '凡', '刪', '咍', '咸', '唐', '嚴', '夬', '宵', '寒', '尤',
        '山', '幽', '庚', '廢', '微', '支', '文', '東', '模', '欣', '歌', '江', '泰', '添', '清', '灰', '痕', '登',
        '皆', '真', '祭', '耕', '肴', '脂', '臻', '蒸', '蕭', '虞', '覃', '談', '豪', '銜', '鍾', '陽', '青', '魂',
        '魚', '鹽', '麻', '齊'],

    '等': ['一', '二', '三', '三A', '三B', '三C', '三銳', '四'],
    '呼': ['合', '開'],
    '入': ['入', '舒'],

    '清濁': ['全清', '全濁', '次清', '次濁'],
    '系': ['幫', '知', '端', '見'],
    '組': ['幫', '影', '日', '曉', '泥', '知', '章', '端', '精', '莊', '見', '非'],
    '母': ['並', '云', '以', '來', '俟', '初', '匣', '奉', '娘', '定', '崇', '常', '幫', '影', '從', '微', '徹', '心',
        '敷', '日', '昌', '明', '曉', '書', '泥', '清', '溪', '滂', '澄', '生', '疑', '知', '章', '端', '精', '群',
        '船', '莊', '見', '透', '邪', '非'],

    '調': ['上', '入', '去', '平'],
    '部位': ['唇齒', '喉', '捲舌', '腭', '軟腭', '雙唇', '齒'],
    '方式': ['塞', '塞擦', '擦', '近', '鼻'],
}